[
 {
  "venue": "The Chapel",
  "title": [
   "The Dig",
   " Nico Yaryan",
   " Boone Howard"
  ],
  "headliner": "The Dig",
  "date": "2017-03-20",
  "startTime": "7:00",
  "cost": 15,
  "artistSummary": "From the beginning,  have been a classic band's band, and a true collaboration: three longtime friends, three songwriters, two singers in a true dual frontman setup, all individuals but all woven more and more tightly together as they have evolved. In a world that rewards drama, reckless moves and often-overwrought narrative twists, The Dig have bucked that trend by focusing on, well, the work: writing song after song to cast off more than they keep, and keep only the best. The Dig do a lot, and they do it the right way — building brick by brick, writing constantly, touring steadily, and most crucially, pushing themselves creatively to make better and better records. Which brings us, of course, to Bloodshot Tokyo, a record rich with ambition and a bright, irresistible ease.\"In the past I think we've tried to create a mindset of writing 'for The Dig'\", says guitarist/keyboard playing Erick Eiser, \"so as to create something cohesive. This time I think we really freed ourselves from that, and just wrote.\" They made the most of their interconnectedness as a way to push themselves forward, writing what singer and bassist Emile Mosseri describes as \"elaborate demos\" for most of the songs. Arrangements were fully worked out, ideas were explored and re-explored before they sat down to record. Emile continues, \"It's not hard to write songs separately, but there's a thing that happens where I'll sometimes have the other guys in my head, even when I'm writing by myself. So in a way, we're kind of always writing together even when we're writing alone. We all grew up playing in different bands together since we were little kids, and have toured with and were inspired by all kinds of different bands for years. I feel like writing this record was the sum of all those years. It's the most wide spanning stylistically and colorful of our records, and also sounds the most like us.\"The result is a tremendously confident record, and one that's far punchier than its predecessors. Even with veritable piles of songs to choose from, it feels oddly apt that Bloodshot Tokyo opens with the brief snippet that is \"Ordinary Mind\". It is a sparkling, hugely inviting riff and a refrain that paves the way, just a small fragment too good to let go of. \"Jet Black Hair\" follows and is an undeniable A-sider, putting the band's pop instincts front and center, never shying away from the groove but never weighed down by it, either. Lead single \"Simple Love\" moves stealthily, winking to just a little something retro but dancing across genres in an exhilaratingly modern way. As a band, The Dig made a choice to turn somewhat from the more ambient sounds of their earlier songs, using those tones as texture to drive songs with other foundations, rather than making it the focal point. Drummer Mark Demiglio, The Dig's relative newcomer, brings a modern pop counterweight to The Dig's moodier side, and it shows. Songs like \"Pool of Rotting Water\" underline that change, going downright beat-driven with just the right amount of glam for a band that is, at its heart, very much a rock band. And what of the records return to love as a theme? Singer and guitarist David Baldwin explains, \"there are elements of both a falling in love and a break up album for sure. I think the songs we picked all generally came from so many different phases and mindsets, there might be different stages in a relationship juxtaposed into the same song. Certain songs may come off like breakup songs but were written while in the peak of a relationship. A kind of regret from the future that hasn't happened yet.\"No band escapes talking about its influences, but its particularly telling that The Dig's members often come back to The Kinks, Harry Nilsson, Betty Harris, Parliament, even Bach — artists who worked in the canon of their eras' pop music, but always with an eye toward upending pop's expectations, fraying the edges, getting weird. Baroque structures and subtle nods pop up throughout , in the low end of \"Bleeding Heart\" or the keyboard swirl of \"Simple Love\", and they permeate the art surrounding this new collection, as well.Everywhere you look these days, there are \"I could do that\"-type cynics. But could they, really? And if they did, could they keep the same wide-eyed spirit The Dig has had for years, since the band's two singers formed their first band as kids? The songs that make up this long-player have a magic borne from that dedication, where tremendous work and discipline meet a lifetime of collaboration and a joyful, insatiable love for songwriting. As it relates to one band's rock record, it may seem strange to point out how cynical the world happens to be right now, but it takes dedication and a deep well of talent to do it like The Dig do it, and do it so well.",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1481137868/event-7071541.jpg",
  "link": null,
  "youTube": [
   "_k5j2buLITM",
   "OZUYDDCvnzs"
  ],
  "similarArtists": [
   "The Bright Light Social Hour",
   "The Features",
   "Middle Kids",
   "Generationals",
   "Rubblebucket"
  ]
 },
 {
  "venue": "The Chapel",
  "title": [
   "Adrian Belew Power Trio",
   " Saul Zonana"
  ],
  "headliner": "Adrian Belew Power Trio",
  "date": "2017-03-21",
  "startTime": "7:00",
  "cost": 32,
  "artistSummary": "Saul toured on bass with The Ace Frehley Band, and on guitar with the Crash Test Dummies. As a solo support artist, Saul has toured with Leon Russell, Glenn Tilbrook, Lisa Loeb, The Spin Doctors,  2006-2008 and many others. In the studio, Saul has worked with many great artists including Taylor Dayne, Blue Oyster Cult, and American Idol finalist Haeley Vaughn.",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1484171469/event-7159700.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1405291%2Ftfly",
  "youTube": [
   "cLoqHWwLhz8",
   "KK9nA3Njpg0"
  ],
  "similarArtists": [
   "ProjeKct X",
   "ProjeKct Two",
   "Julie Slick",
   "ProjeKct Three",
   "Bruford Levin Upper Extremities"
  ]
 },
 {
  "venue": "The Chapel",
  "title": [
   "Andy Shauf",
   " Aldous Harding"
  ],
  "headliner": "Andy Shauf",
  "date": "2017-03-22",
  "startTime": "7:30",
  "cost": 15,
  "artistSummary": "Andy Shauf is a storyteller, a singer of heartbreak and regrets, isolation and loneliness, reflecting his prairie surroundings in Regina, Canada. Meticulously written over four years, Shauf’s The Bearer of Bad News is a warm and welcoming album, bathed in weathered piano, dampened drums, softly-strummed guitars and clarinet, which lends its unique timbre to frequently brighten – or hauntingly underscore – the songs’ darker undercurrents. Fans of Elliott Smith, Nick Drake and Harry Nilsson, take note. \nAldous Harding\nAldous Harding’s music is not for the faint of heart. Disarming in its desolate imagery and stark instrumentation, it deals with the raw materials of life: death, birth, grief and love. There are few happy endings, but the power is in how Harding enters into battle; with a dancer’s grace and a boxer’s stance.\n\nSometimes reminiscent of 60s-era folk singers Vashti Bunyan and Linda Perhacs, Harding’s work lies in more harsh terrain than her forebears – piercing the long history of the genre with a grit and sincerity rarely encountered. Somewhat out of step with the 21st Century, Aldous’ music is accompanied by wry wit and tenacious gall that will see her become a true stayer in the music world. \nHailing from New Zealand’s Southern port town of Lyttelton, Aldous has received attention and accolades from some of the most illustrious corners of the music industry. Her self-titled debut album received 4 stars in MOJO and Uncut, while UK blog The 405 hailed her a “toweringly talented song writer”. \nWhile the album was released nearly a year ago in New Zealand, it continues to thrive after releases in Australia and Europe, Aldous’ music timelessly out of step with fleeting trends. Following the Australian release, she played Sydney & Perth Festivals and Golden Plains. She has also toured with Tiny Ruins, Perfume Genius and Laura Jean.",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1481137942/event-7071543.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1394494%2Ftfly",
  "youTube": [
   "tz1uDa0Yqxs",
   "D1ixbW2o27Q"
  ],
  "similarArtists": [
   "Aidan Knight",
   "Leif Vollebekk",
   "Chris Cohen",
   "Cass McCombs",
   "Chris Staples"
  ]
 },
 {
  "venue": "The Chapel",
  "title": [
   "Jon Russell"
  ],
  "headliner": "Jon Russell",
  "date": "2017-03-23",
  "startTime": "8:00",
  "cost": 20,
  "artistSummary": "Mt. Joy is more of a hill than a mountain. It sits in the rolling hills of Valley Forge National Park, where George Washington once got high with Ben Franklin, probably... We learned how to write songs on Mt. Joy. We sucked more at guitar then, but the vision hasn't really changed: try to follow in the footsteps of all the dope music we grew up on.",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1486423244/event-7410372.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1425538%3F_ga%3D1.228471897.579045736.1484953559",
  "youTube": [
   "KVBqldhcDwc",
   "WeCmu5xhVNw"
  ],
  "similarArtists": [
   "Fairchildren",
   "In Their Thousands",
   "Ryan Mulner",
   "Mychal Cohen",
   "Al James"
  ]
 },
 {
  "venue": "The Chapel",
  "title": [
   "The Sam Chase & the Untraditional",
   " M. Lockwood Porter",
   " The Dixie Giants"
  ],
  "headliner": "The Sam Chase & the Untraditional",
  "date": "2017-03-24",
  "startTime": "8:00",
  "cost": 15,
  "artistSummary": "The Sam Chase has a voice like a Nun on the lam with a mouthful cigarettes and curse words in a lonely bar, drunkenly dancing next to a broken jukebox. His songs are scribbled, not written, on lipstick and sweat stained motel bedsheets because he likes the way the ink bleeds. His guitar runs on diesel and leaks like the morning after too much Whiskey. His is a show you'll probably want to tattoo on your body so everyone will know that you knew him before he was cool.\n\nHailing from the hills of San Francisco, California, Sam and his band whom he lovingly refers to as The Untraditional, take to stages all over the country with a virulent and frenetic passion which many history buffs might liken to the Norse warriors known as The Berserkers, who were known to have fought their battles with an uncontrollable, trance-like fury. Norse literature notes that they would work themselves into a rage before battle, consuming drugged foods, and dressed in nothing but their enemies blood. The Sam Chase and The Untraditional do maintain that spirit, but leave the drugged foods and enemies blood up to the discretion of the crowd. \n\nIn 2012, came the release of his long awaited first studio album, THE SAM CHASE WILL LEAD US TO VICTORY. It took the group all across these United States and back to their home in the Bay Area. The cry came for more, so the band dove head first into writing and preparing a new album. In late May of 2013 THE SAM CHASE WILL NEVER DIE was released. Many children have been conceived to this album since it's release and all of the children who are now born are showing higher than normal levels of intelligence and immunity to most diseases. \n\nAs of the early hours of 2016, Sam and the band have gone back into the studio and laid down 13 brand new tracks. The new album is slated to drop on April 29th, 2016. Many sages and religious fanatics believe that it will bring about the end of days. Stay safe. These are troubled and unpredictable times. \nM. Lockwood Porter\nM. Lockwood Porter’s songs toe the line between country-tinged Americana and straight-up rock-and-roll, with poetic storytelling front and center. A SF Bay Area transplant from rural Oklahoma, Porter’s sound recalls his birthplace and a childhood spent exploring the far reaches of the rock canon. The result is something close to timeless - reminiscent at times of Neil Young, Wilco, Ryan Adams, and Bruce Springsteen.\n\nPorter first caught the attention of many fans and critics with the release of his home-recorded debut LP Judah’s Gone in July 2013. At the time, Independent Clauses called him “a talent to watch”, and The Bay Bridged wrote that he was “poised to join… the national Americana scene with the release of his debut LP, Judah’s Gone.” In October 2014, Porter followed up his promising debut with 27, the bold, carefully crafted work of a talented young artist.\n\nOn 27, we find Porter (who himself turned 27 just before the al) wrestling with a growing awareness of life’s limited possibilities with a mixture of melancholy and defiance similar to that of Carter-era Springsteen, describing failing relationships with a nuanced poignancy reminiscent of Ryan Adams and Lucinda Williams, and eulogizing Big Star founder Chris Bell - who died at age 27 (like Kurt and Jimi, as Porter reminds us) – while name-checking Paul Westerberg and arguing with Neil Young on “Chris Bell”. \n\nIn other words, 27 is a confident-sounding record. That’s a bit ironic for an album that - half breakup record, half quarter-life crisis – is all about the disillusionment and sense of “Is this really all there is?” characteristic of one’s late twenties. But Porter’s willingness to write and sing about the travails and uncertainties of life with courage and honesty is exactly what makes 27 such a compelling album.\n\n27 was primarily recorded in San Francisco’s Hyde Street Studio C - where classic albums like CCR’s Cosmo’s Factory, Grateful Dead’s American Beauty, and CSNY’s Deja Vu were recorded. Showcased on these songs is Porter’s new live band. The band is both tight and spontaneous – sounding something like a cross between Tom Petty’s Heartbreakers, The Band, and Wilco – bringing a rawness and intimacy to the performances that a home recording never could. Porter’s vocals, too, are stronger and more confident – honed by a year of gigging in support of Judah’s Gone. \nThe Dixie Giants\nThe Dixie Giants are a Traditional Jazz group based out of Sonoma County, California. We are comprised of music educators, jazz students, and a wine maker in training.",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1487876500/event-7498726.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1438225%2Ftfly",
  "youTube": [
   "4ppoJJl3Ic0",
   "HA6-DDMBcJI"
  ],
  "similarArtists": []
 },
 {
  "venue": "The Chapel",
  "title": [
   "Antonio Guedes’ Birthday Bash w/ The Chillaquiles",
   " DJ Elan",
   " DJ Izzy Wise"
  ],
  "headliner": "Antonio Guedes’ Birthday Bash w/ The Chillaquiles",
  "date": "2017-03-25",
  "startTime": "8:00",
  "cost": 18,
  "artistSummary": "The Chillaquiles\nAntônio Guedes & The Chilaquiles is a funk-rock-disco-ska-jam-pop band from San Francisco, CA. The lead singer, Antônio Guedes, brings forward various Brazilian influences into his compositions, blending it with others from around the globe, like Afrobeat, American soul, and Latin Jazz, with a psychedelic music twist that suggests to the audience Sergio Mendes, Jerry Garcia, Jorge Ben and Fela Kuti could all be playing in the same band. \n\nThe group was founded in 2012. After a few remarkable shows, they stopped performing due to Guedes’ return to Brazil, where he was living for two years. Not too long ago, in 2015, making his way back up to North American shores, Antônio decided to bring The Chillaquiles band back in action, along with his party/production company BRAZA!. Both band and party have been catching the ears (and the feet) of a fast growing fanbase by producing prestigious nights of funky tropical gatherings, which in the past have awarded him for Hottest Monthly Party by SF Weekly readers.",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1487189655/event-7456939.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1433879%2Ftfly",
  "youTube": [],
  "similarArtists": []
 },
 {
  "venue": "The Chapel",
  "title": [
   "Colony House",
   " Knox Hamilton"
  ],
  "headliner": "Colony House",
  "date": "2017-03-28",
  "startTime": "8:00",
  "cost": 15,
  "artistSummary": "We are a four piece rock band from Franklin, Tennessee. \n\n\"Colony House, a humble apartment complex on 11th Ave. in downtown Franklin, Tennessee, has at some point in each of our lives been our home. Now it is our namesake as we take Franklin, TN with us and travel around the world playing music for those who will listen!\"",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1480964103/event-7034578.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1389556%2Ftfly",
  "youTube": [
   "5Kiz3hcMX5I",
   "Pey_KbA-URg"
  ],
  "similarArtists": [
   "Coin",
   "Knox Hamilton",
   "The Griswolds",
   "Bad Suns",
   "Night Riots"
  ]
 },
 {
  "venue": "The Chapel",
  "title": [
   "Dead Meadow",
   " Matt Hollywood and The Bad Feelings"
  ],
  "headliner": "Dead Meadow",
  "date": "2017-03-29",
  "startTime": "8:00",
  "cost": 18,
  "artistSummary": "Dead Meadow formed in 1998 with Jason Simon on vocals and guitar, Steve Kille on bass, and Mark Laughlin on drums. They began to combine 70s hard rock and 60s psychedelic rock with far out and sometimes mystically minded lyrical themes occasionally even hinting at the obscure genius H. P. Lovecraft and other far out writers of the bizarre and weird.[1] The first album, Dead Meadow, was released in 2000 on Tolotta Records, a label run by Fugazi bassist Joe Lally. The LP version was released by Planaria Records. This was quickly followed by 2001's Howls from the Hills, also released on Tolotta Records. At the completion of \"Howls from the Hills\" John Peel asked Dead Meadow to record a Peel Session which was recorded in Fugazi's home studio, the first time a Peel Session was recorded outside the BBC studios.[1]\n\nn Spring 2002, Laughlin parted ways with the band in order to pursue a career as a lawyer. He was replaced by long-time friend Stephen McCarty ). A live album, Got Live If You Want It, was released in mid-2002, which documented one of the last shows with drummer Mark and was produced by Anton Newcombe of Brian Jonestown Massacre. In early 2003 the band signed with Matador Records and released Shivering King and Others. Along with the heavy song and blues-influenced songs as on the previous two records, the band continued in their psychedelic style, with acoustic elements and ballads. With the addition of second guitarist Cory Shane, Feathers was released in 2005. Simon’s guitar virtuosity is influenced by the droning modal character of Eastern music as by classic rock riffs.\n\nJason Simon is the nephew of The Wire creator David Simon. Dead Meadow's music was used briefly in the episode React Quotes in season five of The Wire.\n\nIn 2007 the band has reverted back to a three piece, made an appearance at the 5th annual Green Man Festival in Crickhowell, Wales and relocated from Washington, D.C. to Los Angeles, California.\n\nIn the beginning of 2008, Dead Meadow released Old Growth on Matador Records. A collection of songs that brought the band back initially to the same farm that their second release Howls from the Hills was created and eventually finished up at the legendary Sunset Sound studio in Los Angeles. As with the last three albums Old Growth was produced by bassist Steve Kille.\n\nLater in that same year a brief session with Andrew Stockdale of Wolfmother led to the reinterpretation of the Dead Meadow song \"Everything's Goin' On\" as a new song \"Pilgrim\" landing on the second release for Wolfmother, \"Cosmic Egg\".\n\nIn March 2010 the band released a feature length live film and soundtrack, \"Three Kings\", that spotlights their stage show along with psychedelic dream scenarios. The live footage and audio was captured at the bombastic final show of the five month \"Old Growth\" tour. The film premiered at the Hollywood Forever Cemetery in Los Angeles, California[2] and was released on the NYC label Xemu Records, co-run by Kille.\n\nJason Simon also announced his September release of his first solo \"self-titled\" acoustic album on TeePee Records.\n\nThe song \"Sleepy Silver Door\" and \"Greensky Greenlake\" were featured in the skate video \"Emerica, Stay Gold.\"",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1486750078/event-7434502.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1432430%2Ftfly",
  "youTube": [
   "6iVLMxtxILY",
   "tp9f6gAI-wU"
  ],
  "similarArtists": [
   "Sleepy Sun",
   "Colour Haze",
   "Causa Sui",
   "Assemble Head In Sunburst Sound",
   "The Black Angels"
  ]
 },
 {
  "venue": "The Chapel",
  "title": [
   "VAGABONG"
  ],
  "headliner": "VAGABONG",
  "date": "2017-03-30",
  "startTime": "7:30",
  "cost": 200,
  "artistSummary": "Boroed Time Presents",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1489951370/event-7652771.jpg",
  "link": "https://boroedtime.com/collections/vagabong-event/products/buy-vagabong-premiere-tickets",
  "youTube": [
   "Rd9xNUzCdnk",
   "Rj1blu_5ze0"
  ],
  "similarArtists": []
 },
 {
  "venue": "The Chapel",
  "title": [
   "Petty Theft - San Francisco Tribute to Tom Petty and the Heartbreakers"
  ],
  "headliner": "Petty Theft - San Francisco Tribute to Tom Petty and the Heartbreakers",
  "date": "2017-04-01",
  "startTime": "8:00",
  "cost": 18,
  "artistSummary": "There are few artists as unique as David Bowie.Every single album served as a reinvention or himself, as well as an innovation of musical creation and execution. Not to be outdone by his own recordings, Bowie also takes his material and reinvents it again depending on what he was doing musically in any given decade. For example, \"Fame\" morphed from the disco seventies to the big, layered sound of the eighties to the industrial noise of the nineties.How does one even begin to pay musical tribute to an ever-changing artist?San Francisco-based Rebel Rebel seek to tackle such a task with their own brand of fearless experimentation and reckless abandon. With Rebel Rebel, the emphasis is on adventure and feeling over simply recreating a song. Mixing well-known tunes with deep album cuts, Rebel Rebel seeks to entertain both the casual listener and die-hard Bowie fanatic.You know the songs. You've loved them for years...But you've never heard them this way.",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1481979239/event-7125651.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1403398%2Ftfly",
  "youTube": [
   "0u0x_MV4VfM",
   "2m3COtyRaNo"
  ],
  "similarArtists": []
 },
 {
  "venue": "The Chapel",
  "title": [
   "The Cairo Gang",
   " CFM",
   " Shannon Lay"
  ],
  "headliner": "The Cairo Gang",
  "date": "2017-04-05",
  "startTime": "8:00",
  "cost": 15,
  "artistSummary": "The Cairo Gang is the songwriting outlet for musician Emmett Kelly from Los Angeles. Throughout its recorded career, The Cairo Gang has appeared live in various formats, including combinations of the massive creative well of the Chicago improvised scene, plus a two-plus years run as the band backing Bonnie “Prince” Billy. Since about 2012, it has made itself known mostly in the basements of Chicago and the greater Midwestern United States as a loud and raw, rock and roll band featuring Kelly’s chiming electric 12-string, the sledgehammer drums of Marc Riordan, Ryan Weinstein’s frenzied bass-lines, and gorgeous harmonic vocal and instrumental accompaniment of Sam Wagster and Gillian Lisee.. It has been reflective of a certain surrendering to the error and tenuous nature of arrangement, and the wet embrace of catharsis, improvisation, rock and roll and the spirit thereof, however physical or metaphysical.",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1489035769/event-7599213.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1448764%2Ftfly",
  "youTube": [
   "2FXoHfufnfk",
   "tQsIhXknpSs"
  ],
  "similarArtists": [
   "Grounders",
   "Here We Go Magic",
   "Torres",
   "Chad VanGaalen",
   "Duke Garwood"
  ]
 },
 {
  "venue": "The Chapel",
  "title": [
   "Third Eye Blind",
   " Emily Afton"
  ],
  "headliner": "Third Eye Blind",
  "date": "2017-04-06",
  "startTime": "8:00",
  "cost": 55,
  "artistSummary": "Participation in the older, untouchable realm of nervous star-making could color a band's identity. In the case of 3EB, it often blurred the perception of their brilliant musical creations. In recent years, those creations have recast the band among a current generation of fans.",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1489528652/event-7631131.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1452176%2Ftfly",
  "youTube": [
   "FJ7pnEzf1p8",
   "_TsvKVXnAe4"
  ],
  "similarArtists": [
   "Better Than Ezra",
   "EVE 6",
   "Goo Goo Dolls",
   "Everclear",
   "Matchbox Twenty"
  ]
 },
 {
  "venue": "The Chapel",
  "title": [
   "Lumerians",
   " Peaking Lights",
   " Potions"
  ],
  "headliner": "Lumerians",
  "date": "2017-04-07",
  "startTime": "8:00",
  "cost": 16,
  "artistSummary": "Between the vast expanses and disparate extremes of space lies “The High Frontier:” a term coined by Gerard K O’Neil in his illustrated 1976 book depicting human colonization of space. In their new thusly titled LP, Lumerians send terrified primates into space in search of wonders both marvelous and harrowing. In a starship powered by gamma-ray-mutated rock, beer-goggled cartographers chart the absurd scales of outer space from subatomic to trans-galactic and the unfathomable void of inner space unbound by physical laws. Inward perception, both fluid and delicate, births, destroys, multiplies and collides temporal realities. Hacking through gnarled carnivorous plants with pyrokinetic machetes, Lumerians thrust forward with Krautrock inspired exploration, Afrobeat’s ritualistic rhythms, post-punk guitar noise and cracked-glacé synth lines culled from perverse 1970’s sci-fi soundtracks. As a followup to 2011’s “Transmalinnia,” “The High Frontier” sets scope outward, points blind-folded at a star map and sets off full blast without making course corrections.\n\nSince forming in 2006, Oakland’s Lumerians have gained notoriety for their intense performances, stunning live visuals and thematic otherworldly releases. Recording from their self-built studio/brewery in a converted store-front church, Lumerians acknowledge the role sound and rhythm have always played in transcendent and ecstatic rituals the world over, from the repetitious drums of tribal animists to the penetrating electronic pulses of neon dance clubs.",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1488394492/event-7531023.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1441638%2Ftfly",
  "youTube": [
   "81_qdYI42Z4",
   "qw44MK5M3Wo"
  ],
  "similarArtists": [
   "The Oscillation",
   "White Manna",
   "White Hills",
   "Psychic Ills",
   "Föllakzoid"
  ]
 },
 {
  "venue": "The Chapel",
  "title": [
   "Royal Jelly Jive",
   " Battlehooch",
   " Loco Tranquilo"
  ],
  "headliner": "Royal Jelly Jive",
  "date": "2017-04-08",
  "startTime": "8:00",
  "cost": 18,
  "artistSummary": "Few bands have the ability to evoke an old-school throwback vibe and yet sound entirely fresh and new at the same time. Royal Jelly is one of those bands. Combining elements of Soul, Rock, Swing and Hip-Hop, Royal Jelly shakes up any dance-party and grooves harder than your typical rock n' roll band dares to go. Fronted by the enigmatic singer Lauren Bjelde, who brings a one-of-a-kind sultry voice to her magnetic stage presence, Royal Jelly leans on the sounds of swingin' horns, gritty keys and a bumpin' rhythm section to carry a crowd into bliss... creating an unforgettable live experience that will leave you wanting more. \nBattlehooch\nBattlehooch is the kind of band you thought went extinct with landline phones & cassette tapes. In one sense they’re a band from another, sturdier era: a band that releases consistently quality material on a consistent basis, a band that doesn’t sacrifice creative drive for commercial interest, a band that grows and evolves with each successive release. From the beautiful madcap mess of debut LP Piecechow to the more refined yet still quite zany jams on Hot Lungs to a cool, polished psych-rock sheen on 2014’s Wink EP, Battlehooch has proven itself as a band built to last. They may possess an old-school mindset, but their music is weird & diverse enough to fit into this wild new century.\n\nFormed in San Francisco, the birthplace of psychedelia, it’s fitting that the six-piece collective echoes the city’s tie-dyed past in its own compositions. However, the group isn’t content with becoming a mere tribute to a time period they never lived through. Instead, Battlehooch updates the sound of psychedelia for a new generation, one that can now access dozens of genres & millions of songs with a few clicks on their iPhones. Battlehooch reflects this modern trend of manic music consumption: on any of their many releases, the listener will be treated to a sonic smorgasbord, bouncing from hard rock to dance-pop to cartoony head trips to flirtations with electronica & jazz & Afrobeat & everything else in between within the span of a few minutes, sometimes even seconds. \nLoco Tranquilo\nLoco Tranquilo is a San Francisco-based ensemble whose music features swirling, percussive jazz and international folk influences.",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1486601023/event-7416951.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1429755%2Ftfly",
  "youTube": [
   "LDxNGOlYIts",
   "9DHXTaBL7tk"
  ],
  "similarArtists": [
   "opusoid",
   "American Babies",
   "Maxwell",
   "Lilly Hiatt",
   "Ladybug Mecca"
  ]
 },
 {
  "venue": "The Chapel",
  "title": [
   "Pegi Young & The Survivors featuring Spooner Oldham",
   " Kelvin Holly",
   " Phil Jones & Shonna Tucker"
  ],
  "headliner": "Pegi Young & The Survivors featuring Spooner Oldham",
  "date": "2017-04-09",
  "startTime": "7:00",
  "cost": 18,
  "artistSummary": "Pegi Young & The Survivors\nPegi Young’s powerful new album, Raw, gets right to the point. Opening cut “Why” kicks off with Young’s impassioned alto, demanding, “Why’d you have to ruin my life? Why’d you have to be so mean?” Over the soulful Americana rock of her band the Survivors – led by legendary keyboardist/songwriter Spooner Old- ham – Young taps into a surprisingly primal force.\n\nThere’s a reason for that. Young wrote most of Raw in the wake of her 2014 sepa- ration and divorce from Neil Young, to whom she’d been married thirty-six years. Over the decades, the pair had raised a family, made music together, and worked to support northern California’s Bridge School for severely disabled children. Pegi founded the Bridge School in 1986 after being unable to find the right kind of care for their son, Ben, who has cerebral palsy.\n\n“[Raw] was very cathartic for me,” Young says. “What happened was real, but I also look at this record as having a universal quality to it. I’m certainly not the only one to go through a late-in-life divorce, and I’m not going to be the last. But in my case, it was so painful because we’d shared so many years building a life, together, weathering its ups and downs.\n\nYet the songs – most co-written with guitarist Kelvin Holly and Oldham – aren’t all expressions of anger. The first track to be released from the album is “Too Lit- tle Too Late,” a raw and poetic psalm of regret, the truth-tellin’ “Gave My Best to You” and a rockin’ update on “These Boots are Made for Walkin’” convey resili- ence and sass. A gorgeous, stripped-down version of Don Henley’s “The Heart of the Matter” explores the grace of forgiveness. As a whole, the album is a journey from shock, to rage, to sadness, to strength, but not necessarily in that order.\n\nYoung sees Raw as the soundtrack to the seven stages of grief. “It’s not a linear process,” she says. “You bounce back and forth. And each song could be sung by either party.”\n\nIn addition to chronicling this new chapter of her life, Raw also reflects the music Young has been drawn to since growing up in northern California in the 1960s. “Yes, I remember dancing in the living room to Motown,” she says. “I’ve always loved harmonies, lyrics, and rhythm. I used to go to the Fillmore and the Avalon and Winterland.”\n\nAlthough it would be decades before she would take her work to the stage, Young was writing poetry in grade school and studying it in college. She picked up an acoustic and taught herself some chords and folk covers, and became a bona fide hippie nomad: hitchhiking around the country, with stops in Vermont and Cana- da. By 1972, she’d settled down with her dog in a teepee in northern California. “I bought it for $200,” she says. “My first home.” In 1974, she was working in a res- taurant and living in the teepee when she met Neil Young.\n\nThe rock & roll road, family life, tending to the Young children, and the creation and operation of the Bridge School kept her busy. But by the early ‘aughts, Young, having toured with her ex-husband and spent time in the studio with the best of the best, was ready to become a recording artist in her own right, encouraged by Neil’s longtime manager Elliot Roberts. Two songs written during “the teepee years” ultimately graced her eponymous 2007 debut album. “I mostly set out to do covers,” Young says of that collection. “I was really shy about breaking out my own songs, but about three days into it, my guitarist original lead guitarist, An- thony Crawford convinced me to bring in my stuff.” The country-rock-tinged al- bum also marked her first recorded work with Spooner Oldham and the late pe- dal steel icon Ben Keith, both of whom she’d sang alongside on Neil’s tours. They formed the original core of Pegi Young and the Survivors.\n\nRaw features Oldham and several more recent Survivors, including Muscle Shoals-based guitarist Kelvin Holly, a veteran of Little Richard’s band; drummer Phil Jones; and the newest “Survivor” Shonna Tucker (Drive-By Truckers), who’ve added soulful muscle to the sonic texture. The group lost their original Bassist the renown Rick Rosas in 2014.\n\n“With Kelvin in the band, we’re going to a place in my wheelhouse, more R & B stuff, like Otis Clay’s ‘Trying to Live My Life Without You,’ which also has the great horn sounds [from the TexiCali Horns] and harmonies of the girl groups I listened to as a kid.”\n\nOf her five albums, Raw is the first on which Young is credited with production duties. Her M.O: “Be authentic, be true, sing what’s in your heart. It’s not about making it perfect, it’s about letting it be real, sometimes raw and flawed, as long as it’s true.” This also includes highlighting her band, the Survivors, whose cama- raderie she credits with strengthening and inspiring her. That is most evident on unabashed rocker “You Won’t Take My Laugh Away From Me,” a defiant strut of hard-won confidence that ends with Young’s joyful laughter.\n\n“My laugh has always been rather distinctive,” Young says. “It’s something I can hold on to that’s still mine.” As for the future, Young has started work on a mem- oir and making plans for a tour around Raw’s release. “I am a survivor,” she re- lates. “Although we named the band The Survivors after Ben Keith died, We didn’t have any idea some ten years ago, what an apt name it would turn out to be! I’ve gone through a lot of good stuff and scary stuff, and I will keep going for-ward.”",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1488551981/event-7566387.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1445278%2Ftfly",
  "youTube": [
   "oai7LvGc0FA",
   "bH_jKBeRock"
  ],
  "similarArtists": []
 },
 {
  "venue": "The Chapel",
  "title": [
   "Cosmonauts",
   " The Molochs",
   " Max Gardener",
   " DJ Lacy Lust"
  ],
  "headliner": "Cosmonauts",
  "date": "2017-04-11",
  "startTime": "8:00",
  "cost": 15,
  "artistSummary": "Cosmonauts came into being in 2009 in outer space or Orange County, depending on the way you like to look at things. The band was originally formed by Derek Cowart and Alexander Ahmadi after he heard Cowart play a Spaceman3 song solo at a show in their home town of Fullerton, CA. The two were students at different high schools but as it turned out, of the same musical school of thought: two lovers of lo-fi, adorers of the atmospheric, kindred pop-loving spirits. The two bonded over the Velvet Underground and Brian Jonestown Massacre, and quickly turned their mutual appreciation club into a band. Cosmonauts have been making music ever since, picking up bassist James Sanderson and a host of different drummers along the way (the spot is currently filled by Mark Morones). Now residing in Los Angeles, they’ve put out a number of releases (including three full length albums) through Burger Records and various other labels.\n\nThey’ve toured extensively through the US and Europe, and played alongside Brian Jonestown Massacre, The Pixies, Slowdive, Black Lips, Belle & Sebastian, and more, though Cosmonauts don’t exactly fit neatly into the fabric of their scene: too psychedelic to be punk, too punk to be psychedelic, and too absorbed in making their own brand of music to care.\n\nTheir latest offering, A-OK!, is out August 19th via Burger Records. \nThe Molochs\nFirst, let’s meet Moloch. You remember him, right? The ancient god, the child eater, the demander of sacrifice, the villain in Ginsberg’s Howl(and also real life) and now the personal antagonist of singer and songwriter Lucas Fitzsimons, who named his band the Molochs because he knew he’d have to make sacrifices to get what he needed, and because he always wanted a reminder of the Ginsbergian monster he’d be fighting against. And so this is how you make a record right now: you fight for every piece, and when Moloch takes apart your relationships and career potential and leaves you sleeping on couches or living in terrifying apartments and just about depleted from awful people involving you in their awful decisions, you grab a bottle of wine (and laugh at the cliché) and put together another song. And once you do that eleven hard-won times in total, you get a record like America’s Velvet Glory: honest, urgent, desperate and fearless because of it.\n\nFitzsimons came to his calling in an appropriately mythic way, born in a historic city not far from Buenos Aires and raised in L.A.’s South Bay—just outside of Inglewood—where he was immersed in the hip-hop hits on local radio. (Westside Connection!) The summer d before he started middle school, a close friend got an electric guitar, and Fitzsimons felt an enirresistible inexplicable power: “I'd go back home and I’d look up guitar chords on the internet—even though I had no guitar—and just imagine how I WOULD play them. I was slowly getting obsessed.” When he was 12, his parents took him back to Argentina, and on the first night, he discovered a long-forgotten almost-broken classical guitar in the basement of his ancestral home: “It sounds made-up, but it’s true,” he says. “I didn't put the guitar down once that whole trip—took it with me everywhere and played and played. When I got back to L.A., I bought my first guitar practically as the plane was landing.”\n\nThis started a long line of bands and a long experience of learning to perform in public, as Fitzsimons honed intentions and ideas and tried to figure out why that guitar seemed so important. After a trip to India in 2012, he returned renewed and ready to start again, scrapping his band to lead something new and uncompromising. This was the true start of the Molochs: “It didn't make any sense to not do everything exactly the way I wanted to do it,” he says. “I was so shy and introverted that singing publicly sounded like a nightmare come true. But I didn't have a choice—I heard something inside of me and I needed to be the one to express it.”\n\nThe first album Forgetter Blues was released with Fitzsimons’ guitarist/organist and longtime bandmate Ryan Foster in early 2013 on his own label—named after a slightly infamous intersection in their then-home of Long Beach—and was twelve songs of anxious garage-y proto-punk-y folk-y rock, Modern Lovers demos and Velvet Underground arcana as fuel and foundation both. It deserved to go farther than it did, which sadly wasn’t very far. But it sharpened Fitzsimons and his songwriting, and after three pent-up years of creativity, he was ready to burst. So he decided to record a new album in the spirit of the first, and in the spirit of everything that the Molochs made so far: “I wanted to spend less time figuring out HOW we were gonna do something and just actually do it.”\n\nThe result is America’s Velvet Glory, recorded with engineer Jonny Bell at effortless (says Fitzsimons) sessions at Long Beach’s JazzCats studio. (Also incubator for Molochs’ new labelmates Wall of Death and Hanni El Khatib.) It starts with an anxious electric minor-key melody and ends on a last lonesome unresolved organ riff, and in between comes beauty, doubt, loss, hate and even a moments or two of peace. There are flashes of 60s garage rock—like the Sunset Strip ’66 stormer “No More Cryin’” or the “Little Black Egg”-style heartwarmer-slash-breaker “The One I Love”—but like one of Foster’s and Fitzsimons’ favorites the Jacobites, the Molochs are taking the past apart, not trying to recreate it.\n\nYou can hear where songs bend, where voices break, where guitars start to shiver and when strings are about to snap; on “You And Me,” you can almost hear Lou Reed’s ghost call for a solo, and on “I Don’t Love You,” you get that subway-sound guitar and find out what happens when Jonathan Richman’s G-I-R-L-F-R-E-N goes wrong. And of course there’s the charismatic chaos of bootleg basement-tape Dylan—always Dylan, says Fitzsimons—and the locked-room psychedelia of Syd Barrett, especially on “Charlie’s Lips,” Fitzsimons’ ode to—or antidote to—those times when he felt the bleakness completely: “Then a bird lands on a branch nearby, you hear leaves fluttering, you hear a child laughing … all of a sudden things don't seem so bad anymore.”\n\nSo Moloch might still be out there, devouring his sacrifices, but the Molochs are still fighting, too. And that’s why Fitzsimons picked the band name—it’s so he remembers what he’s up against. He’s not celebrating the destroyer of youth and individuality and creativity, he says: “I’m just keeping him in sight so that he doesn't win.” – Christopher Ziegler \nMax Gardener\nMax Gardener makes his self-described “bedroom theme music” amidst the solitude of his California bedroom, and he intends for you to hear it in the solitude of yours.\n\nOn debut record Memory Lounge [Sports Day Records and Citrus City Records], Gardener drifts forth, mixing the sunny trademarks of sixties psych and nostalgia-inducing guitar pop hooks with his omnipresent optimism and a healthy dose of melancholy.\n\n“I was in a weird place,” he says of the recording process, conducted entirely in the privacy of his Long Beach home. “I’d be stuck in my room, recording for a whole day, just drinking coffee and kind of going crazy.”\n\nThe result is a series of kaleidoscopic songs about times past and the days ahead. Memory Lounge contains sparkling multitudes: songs for the beachside happy endings of a teen movie, long nights spent dreaming alone, or endless summer evenings with friends. A lilting guitar bounces along the radiant “Space for the Memories.” On “He Still Loves Her,” Gardener spins bittersweet longing into a shimmering melody reminiscent of The Kinks, The Shins, and The Radio Dept.",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1488491995/event-7544012.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1440803%2Ftfly",
  "youTube": [
   "EwTBah7oW6w",
   "_nNtY-eoIeE"
  ],
  "similarArtists": [
   "Dead Ghosts",
   "Night Beats",
   "Jacuzzi Boys",
   "Froth",
   "Audacity"
  ]
 },
 {
  "venue": "The Chapel",
  "title": [
   "Hinds",
   " Twin Peaks",
   " White Mystery"
  ],
  "headliner": "Hinds",
  "date": "2017-04-13",
  "startTime": "8:00",
  "cost": 20,
  "artistSummary": "Madrid-based garage rockers  started as a duo of CarlottaCosials and Ana García Perrote. Shortly before releasing their first single \"Demo\" in 2014 the duo became a four piece, with close friend, ex guitar player and singer Ade Martín on bass and one of their first fans, Amber Grimbergen on drums. During the rest of the year and throughout 2015 they embarked on their first world tour, playing everywhere from Thailand, Vietnam and Australia to the United States to the worldwide festival circuit,including SXSW (in which they played 16 concerts in just 4 days), Glastonbury and Burgerama. They have received very positive reviews in Pitchfork, Pigeons and Planes, Gorilla vs. Bear, Paste, SPIN, Entertainment Weekly and NME.Their debut album, Leave Me Alone, made its way into the world on Friday, January 8, 2016 via Mom + Pop Music.Fresh off their release, Hinds is receiving praise for their work. \"This great garage-rock crew from Madrid folds decades of naïf-rock history into its craftily shambling tunes,\" said Rolling Stone. Pitchfork suggests its \"[Carlotta] Cosials and [Ana] Perrote's shared vocal responsibilities, which fit perfectly together\" that \"truly set Hinds apart.\" Entertainment Weekly calls Hinds \"...the year's buzziest indie breakout,\" while SPIN asks \"Whether seeing Hinds live, or listening to their debut album, Leave Me Alone, one question always comes to mind: Can I join?\"",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1486424466/event-7410480.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1427952%3F_ga%3D1.35715044.579045736.1484953559",
  "youTube": [
   "ZAVWGVTapqo",
   "FL94P9Yf8qM"
  ],
  "similarArtists": [
   "Bleached",
   "Sunflower Bean",
   "Eleanor Friedberger",
   "La Sera",
   "Charlie Hilton"
  ]
 },
 {
  "venue": "The Chapel",
  "title": [
   "Twin Peaks",
   " Hinds",
   " White Mystery"
  ],
  "headliner": "Twin Peaks",
  "date": "2017-04-14",
  "startTime": "8:00",
  "cost": 20,
  "artistSummary": "Co-produced by the band and longtime collaborator R. Andrew Humphrey, and mixed by new confidant John Agnello (Dinosaur Jr., Kurt Vile, Sonic Youth), the rec-ord is by turns raw, polished and wise beyond its years. The diverse new songs beg the listener to sway slowly, bang their head wildly and question what they were do-ing wasting emotional time on anything less. It is a marked, and some may say ma-ture, development for a band that doesn't know how to play it safe. They aren't here to tell you what youth is like or what being a little older now means, though; they want to join you in a conversation about why we hurt, love and tug at each other.",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1486425093/event-7410510.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1427967%3F_ga%3D1.5626999.579045736.1484953559",
  "youTube": [
   "SEYgTStXCmA",
   "Np1Qo8CsW00"
  ],
  "similarArtists": [
   "The Orwells",
   "Whitney",
   "Smith Westerns",
   "Parquet Courts",
   "Broncho"
  ]
 },
 {
  "venue": "The Chapel",
  "title": [
   "Howie Day"
  ],
  "headliner": "Howie Day",
  "date": "2017-04-18",
  "startTime": "7:00",
  "cost": 20,
  "artistSummary": "Howie Day’s emotionally resonant lyrics and inventive melodies have earned him both critical praise and a legion of devoted fans. He is known for his energetic, heartfelt shows, where he connects with audiences through the strength of his songwriting and his quirky sense of humor. Day’s warm tenor voice “soars into fluttering, high registers, but also grates with real, pleading grit,” as one critic put it. After sales of over a million records and two Top 10 hits, Day is back on the road in support of his new studio album, Lanterns.\n\nA native of Bangor, Maine, Day began playing piano at age five and guitar at age 12. By 15, he was writing his own songs and performing across New England. Shortly after graduating high school, Day became a fixture at college coffeehouses across the U.S. He wrote, financed and released his first effort, Australia, which was named Best Debut Album at the 2001 Boston Music Awards. The Boston Globe called Day “gorgeously seasoned, far beyond his years” with “a brave, beautiful singing voice.” During his relentless touring schedule, Day began experimenting with effects pedals and loop-sampling techniques as he performed, layering live percussion with vocal harmonies and guitar parts to become a veritable one-man band. He went on to sell over 30,000 copies of Australia as he navigated the independent music scene and continued to hone his craft.\n\nAfter signing with Epic Records, Day released his major-label debut, Stop All The World Now, and hit the road to support it. The constant promotion paid off: Stop was certified gold in the U.S. and spawned two Top 10 radio hits: “She Says” and the platinum single “Collide.” After three subsequent years of intense worldwide touring, Day moved to Los Angeles and returned to the studio. His next release, Sound the Alarm, built on the emotionally complex spirit of its predecessor and delved into Day’s journey from indie wunderkind to platinum-selling artist. Its lead single, “Be There,” became a staple at modern AC radio.\n\nAfter parting ways with Epic and relocating to New York City in 2010, Day released the Ceasefire EP on his own label, Daze. Over the next two years, as a reenergized Day toured North America, Australia and Asia, new songs began to emerge and evolve. His fourth full-length album, Lanterns, was recorded in Boston with producer and longtime friend Mike Denneen. Awash with a warm musicality and unique instrumentation, the album also features guest vocals from Aimee Mann. Lanterns was released in April 2015.",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1488914798/event-7589436.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1447220%2Ftfly",
  "youTube": [
   "WMA6T0kF5L8",
   "UQGRiYyjTVQ"
  ],
  "similarArtists": [
   "Five for Fighting",
   "Edwin McCain",
   "Matt Nathanson",
   "Josh Kelley",
   "Mat Kearney"
  ]
 },
 {
  "venue": "The Chapel",
  "title": [
   "Ezra Furman"
  ],
  "headliner": "Ezra Furman",
  "date": "2017-04-19",
  "startTime": "8:00",
  "cost": 16,
  "artistSummary": "Ezra Furman started writing songs. Then he broke up with his longtime sweetie and formed a blistering rock and roll band (in Boston) called Ezra Furman & the Harpoons. They made albums: Banging Down the Doors (2007), Inside the Human Body (2008), Moon Face (2009) and Mysterious Power (2011). And they played some really great shows. They even became popular overseas.\n\nThen Ezra went solo. He holed up in the attic (in Chicago where he is from) and made The Year of No Returning, released in 2012. Ezra’s follow-up album, entitled Day of the Dog, will be released in September of 2013 on Bar/None Records. Right now he is one of the best songwriters around. He rocks, he connects, he haunts and he kills. These days he usually plays with his wild band, The Boy-Friends. He's one of our finest Rock ‘n’ Roll fools, heart open wide and fangs bared. Keep your eyes peeled, ladies and gents. He's far from finished.",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1487880193/event-7509780.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1438903%2Ftfly",
  "youTube": [
   "w3q5IkBYunY",
   "j5vFWPmz68s"
  ],
  "similarArtists": [
   "Ezra Furman & The Harpoons",
   "John Grant",
   "Bill Ryder-Jones",
   "Matthew E. White",
   "Sweet Baboo"
  ]
 },
 {
  "venue": "The Chapel",
  "title": [
   "The Dip",
   " Fritz Montana",
   " White Knuckles"
  ],
  "headliner": "The Dip",
  "date": "2017-04-20",
  "startTime": "8:00",
  "cost": 18,
  "artistSummary": "Hailing from Seattle, The Dip is an electrifying seven-piece ensemble that melds vintage rhythm and blues and modern pop with \"impeccably crafted, 60's-steeped soul\" (KEXP). The group quickly gained notoriety throughout the Pacific Northwest for their eminently danceable live shows that feature the powerful vocals of frontman Tom Eddy (Beat Connection), bolstered by the deep pocket of their unmistakably detailed rhythm section, and the spirited melodies of “The Honeynut Horns”. Hard-hitting but sensitive, The Dip harkens back to the deep soul roots of the decades past and pays tribute to this history through the grit and grace of their performances. The band's 2015 self-titled debut, recorded to tape at Avast! Studios, propelled them to notable appearances at prodigious festivals such as Sasquatch! Music Festival, High Sierra Music Fest, Summer Meltdown, and Capitol Hill Block Party as well as built anticipation for their 2016 release, Won't Be Coming Back (EP). The band finds themselves prepping for a busy 2017 with a three week national tour scheduled for this Spring, and the release of a brand new single entitled “Sure Don’t Miss You” (vinyl release from Colemine Records). Whether young or old, you can’t help yourself from grinning ear-to-ear when you see these gentlemen hit the stage. I wouldn’t hold back dancing for that matter either! Ladies and gentleman, give it up for The Dip! Hit up the dance floor, and put it in your hip!",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1488551983/event-7566388.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1445372%2Ftfly",
  "youTube": [
   "XtG8X5mCcMA",
   "FOE3avKpiyo"
  ],
  "similarArtists": [
   "Terri Walker",
   "Andy Allo",
   "Vulfpeck",
   "Sly Johnson",
   "Joey Dosik"
  ]
 },
 {
  "venue": "The Chapel",
  "title": [
   "Emily King"
  ],
  "headliner": "Emily King",
  "date": "2017-04-21",
  "startTime": "8:00",
  "cost": 18,
  "artistSummary": "Emily King's a Grammy-nominated singer/songwriter born and raised in Manhattan's Lower-East Side. King recently released the critically acclaimed EP 'Seven', touring and playing live with the likes of Maroon 5, John Legend, Emeli Sande, Alicia Keys, Aloe Blacc Sara Bareilles and countless others along the way. King celebrates her roots, pop, soul, and indie influences by carefully crafting compositions that serve as the perfect vehicle for her polished, lush vocals..",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1489035772/event-7599217.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1448470%2Ftfly",
  "youTube": [
   "eiTlX1E0c6Q",
   "DjxvOfn7rLc"
  ],
  "similarArtists": [
   "Amel Larrieux",
   "Alice Smith",
   "Jill Scott",
   "Bilal",
   "Goapele"
  ]
 },
 {
  "venue": "The Chapel",
  "title": [
   "Tara Jane O'Neil",
   " Califone"
  ],
  "headliner": "Tara Jane O'Neil",
  "date": "2017-04-24",
  "startTime": "8:00",
  "cost": 16,
  "artistSummary": "Tara Jane ONeil is a multi-instrumentalist, composer, and visual artist. She creates melodic and experimental music under her own name and in collaboration with her brilliant friends. Her recordings and live performances range from solo songing to noise improvisations. TJO has composed and performed music and sound for films, theater and dance performances, and written large and small ensemble experimental architectures.\n\nAs a solo artist, TJO has released 7 albums internationally. She was a founding member of Rodan and several other bands, and has collaborated on recordings and stages with musical artists such as the groups Ida, Mirah, Jackie O MF, Lucky Dragons, Mount Eerie, LIttle Wings, Papa M, Come, and Michael Hurley, Catherine Irwin, Marisa Anderson, Amy Ray, Nikaido Kazumi, Ben Vida and many more. In addition to rock clubs, galleries and DIY spaces all around north America, Europe, and Japan, she has performed at All Tomorrow’s Parties, the Centre de Pompidou, the Whitney Museum of American Art, the New Musuem, TBA festival, High Desert Test Sites and many many others. She has shown her visual art in galleries all over the northern hemisphere and had three monographs of her visual art published. Her new self-titled album will be released by Gnomonsong records in April 2017.",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1489444223/event-7617410.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1451127%2Ftfly",
  "youTube": [
   "yPvfHtuImIA",
   "Kg0VrXwlC64"
  ],
  "similarArtists": [
   "Nina Nastasia",
   "Shannon Wright",
   "Julie Doiron",
   "Ida",
   "Scout Niblett"
  ]
 },
 {
  "venue": "The Chapel",
  "title": [
   "Translator",
   " The Long Ryders"
  ],
  "headliner": "Translator",
  "date": "2017-04-26",
  "startTime": "8:00",
  "cost": 20,
  "artistSummary": "The combination of 2 talented songwriters and a powerful creative rhythm section became the key to their popularity and propelled them to San Francisco where they were almost immediately signed to Howie Klein's independent label, 415 Records, on the strength of the demo tape they sent to college radio station KUSF: the loose and rambling yet laconic \"Everywhere That I'm Not\" has remained the band's signature tune. The song appeared on 's debut album Heartbeats And Triggers, recorded with producer David Kahne (Paul McCartney, Bangles) and became an underground and College radio hit in 1982 – featured in the first ads for MTV. “I remember being on our first tour when we were playing at the Ritz (in New York) and thinking no one was gonna come,” recalled Barton. “And then coming around the corner and seeing this line going out the door and down the block and it was like ‘Oh my God...we sold the place out!’.",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1484171951/event-7159701.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1405919%2Ftfly",
  "youTube": [
   "SXjBtv4j-LM",
   "Bl3dFslQYqc"
  ],
  "similarArtists": [
   "Robert Hazard",
   "Ebn-Ozn",
   "Gary Myrick & The Figures",
   "Peter Godwin",
   "Figures On A Beach"
  ]
 },
 {
  "venue": "The Chapel",
  "title": [
   "Kawehi"
  ],
  "headliner": "Kawehi",
  "date": "2017-04-28",
  "startTime": "8:00",
  "cost": 18,
  "artistSummary": "Kawehi is a new breed of musician, a one-woman-band from Lawrence, Kansas who uses technology to carry the weight of a full band on her own. She was seen and heard in the Super Bowl 50 commercial for Intel, has landed in publications such as People Magazine, Spin, Esquire, and on the front page of Reddit. Elle magazine has dubbed Kawehi “The Genius One-Woman Band” and HuffPo has praised Kawehi as “Killing the DIY scene.” With over 11 million views on her YouTube channel, Kawehi has been performing to sold out shows across the nation and has already been on three headlining tours. With eight Kickstarter projects under her belt, Kawehi shows no signs of slowing down. Her newest project, EVE – a Sci-Fi Short Film/Visual Album – was funded via Kickstarter in less than a day and is set to release in the Spring of 2017.",
  "photo": "https://res.cloudinary.com/dostuff-media/image/upload//c_fill,g_faces,b_rgb:090909,q_60,fl_lossy,w_1200,h_450/v1485805098/event-7351527.jpg",
  "link": "http://www.shareasale.com/r.cfm?u=1098158&b=234786&m=27601&afftrack=&urllink=https%3A%2F%2Fwww.ticketfly.com%2Fpurchase%2Fevent%2F1423828%2Ftfly",
  "youTube": [
   "c8Wkhoj4VQA",
   "kJxdbmT6kRg"
  ],
  "similarArtists": [
   "I AM KAWEHI",
   "Bryan Tolentino",
   "Eddie Kamae",
   "Brittni Paiva",
   "MC Xander"
  ]
 }
]